; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-89)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 - object)
 (:init 
    (arm-empty)
    (clear b9)
    (on b9 b6)
    (on b6 b22)
    (on b22 b25)
    (on b25 b12)
    (on b12 b15)
    (on b15 b3)
    (on b3 b11)
    (on b11 b17)
    (on b17 b2)
    (on b2 b13)
    (on b13 b14)
    (on b14 b23)
    (on b23 b7)
    (on b7 b19)
    (on b19 b8)
    (on b8 b26)
    (on b26 b16)
    (on b16 b5)
    (on b5 b4)
    (on-table b4)
    (clear b21)
    (on b21 b1)
    (on-table b1)
    (clear b10)
    (on b10 b18)
    (on b18 b20)
    (on b20 b24)
    (on-table b24))
 (:goal (and 
(on-table b24)
(clear b23) (on b23 b6)
))
)

; plan
1. (unstack b9 b6)
   deleted: (on b9 b6) (clear b9) (arm-empty)
   added: (holding b9) (clear b6)
   goals met: 1 of 3
2. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 3
3. (unstack b6 b22)
   deleted: (on b6 b22) (clear b6) (arm-empty)
   added: (holding b6) (clear b22)
   goals met: 1 of 3
4. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 1 of 3
5. (unstack b22 b25)
   deleted: (on b22 b25) (clear b22) (arm-empty)
   added: (holding b22) (clear b25)
   goals met: 1 of 3
6. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 1 of 3
7. (unstack b25 b12)
   deleted: (on b25 b12) (clear b25) (arm-empty)
   added: (holding b25) (clear b12)
   goals met: 1 of 3
8. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 1 of 3
9. (unstack b12 b15)
   deleted: (on b12 b15) (clear b12) (arm-empty)
   added: (holding b12) (clear b15)
   goals met: 1 of 3
10. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 1 of 3
11. (unstack b15 b3)
   deleted: (on b15 b3) (clear b15) (arm-empty)
   added: (holding b15) (clear b3)
   goals met: 1 of 3
12. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 1 of 3
13. (unstack b3 b11)
   deleted: (on b3 b11) (clear b3) (arm-empty)
   added: (holding b3) (clear b11)
   goals met: 1 of 3
14. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 1 of 3
15. (unstack b11 b17)
   deleted: (on b11 b17) (clear b11) (arm-empty)
   added: (holding b11) (clear b17)
   goals met: 1 of 3
16. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 1 of 3
17. (unstack b17 b2)
   deleted: (on b17 b2) (clear b17) (arm-empty)
   added: (holding b17) (clear b2)
   goals met: 1 of 3
18. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 1 of 3
19. (unstack b2 b13)
   deleted: (on b2 b13) (clear b2) (arm-empty)
   added: (holding b2) (clear b13)
   goals met: 1 of 3
20. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 1 of 3
21. (unstack b13 b14)
   deleted: (on b13 b14) (clear b13) (arm-empty)
   added: (holding b13) (clear b14)
   goals met: 1 of 3
22. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 1 of 3
23. (unstack b14 b23)
   deleted: (on b14 b23) (clear b14) (arm-empty)
   added: (holding b14) (clear b23)
   goals met: 2 of 3
24. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 2 of 3
25. (unstack b23 b7)
   deleted: (on b23 b7) (clear b23) (arm-empty)
   added: (holding b23) (clear b7)
   goals met: 1 of 3
26. (stack b23 b6)
   deleted: (clear b6) (holding b23)
   added: (arm-empty) (clear b23) (on b23 b6)
   goals met: 3 of 3
